VatEngine/test1-BLFR.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?><?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?><iVATEngineInput><Supplier><ID>21535</ID><Name>BECOMPANY NV</Name><Address>TOEKOMSTSTRAAT 10</Address><ZIP>2000</ZIP><City>ANTWERPEN</City><Country>BE</Country><RegOfCommerce></RegOfCommerce><BancAccountNumber></BancAccountNumber><IBAN></IBAN><BIC></BIC><TelephoneNumber></TelephoneNumber><FaxNumber></FaxNumber><EmailAddress></EmailAddress><SpecialType>0</SpecialType><DeductionType>0</DeductionType><VATNumberSupplier Country="BE"><VATNumber>BE0686731303</VATNumber><VATNumberType>1</VATNumberType><Name></Name><Address1></Address1><Address2></Address2><Address3></Address3><TaxNumber></TaxNumber><BelongsToFiscalUnit>0</BelongsToFiscalUnit></VATNumberSupplier><CountryChosenVATNumber>BE</CountryChosenVATNumber></Supplier><Customer><ID>21540</ID><Name>FRCOMPANY SA</Name><Address>RUE NATIONAL 15</Address><ZIP>59800</ZIP><City>LILLE</City><EmailAddress></EmailAddress><Country>FR</Country><SpecialType>0</SpecialType><VATNumberCustomer Country="FR"><VATNumber>FR01160568416</VATNumber><VATNumberType>1</VATNumberType><Name></Name><Address1></Address1><Address2></Address2><Address3></Address3><RequiredOnInvoicePicture>false</RequiredOnInvoicePicture><BelongsToFiscalUnit>0</BelongsToFiscalUnit></VATNumberCustomer><CountryChosenVATNumber>FR</CountryChosenVATNumber></Customer><InvoiceProperties><DocumentType>0</DocumentType><Disconto>0</Disconto><Currency1>EUR</Currency1><InvoiceNumber></InvoiceNumber><ReferenceInvoiceNumber></ReferenceInvoiceNumber><InvoiceDate>2018-06-27</InvoiceDate><OfficialLanguage>1</OfficialLanguage></InvoiceProperties><Item ID="1"><Properties><Description>sell and install laptop</Description><InternationalDescription LanguageID="1">levering met installatie (-110-)</InternationalDescription><InternationalDescription LanguageID="2">livraisons avec installation ou montage (-110-)</InternationalDescription><InternationalDescription LanguageID="3">supply with installation or assembly  (-110-)</InternationalDescription><InternationalDescription LanguageID="5">Lieferung, und Installation (-110 -)</InternationalDescription><TaricCode></TaricCode>
<ItemClassificationCode>110</ItemClassificationCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>1000</UnitPriceExclVAT><TotalAmountExclVAT>1000</TotalAmountExclVAT><PackagingCosts>0</PackagingCosts></Amounts><Number>1</Number><Unit>p/st</Unit><VATRate>0</VATRate><Reduction>0</Reduction><AdditionalProperties><PropertiesPerCountry Country="BE"><VATRateCode>S</VATRateCode></PropertiesPerCountry><PropertiesPerCountry Country="FR"><VATRateCode>S</VATRateCode></PropertiesPerCountry><PropertiesPerCountry Country="FR"><VATRateCode>S</VATRateCode></PropertiesPerCountry><EngineParameter1>AB</EngineParameter1><EngineParameter2></EngineParameter2><EngineParameter3></EngineParameter3></AdditionalProperties><OutOfVAT>0</OutOfVAT><ReportingProperties><CommodityCode></CommodityCode></ReportingProperties></Properties><Conditions><ShipFrom><CountryDeparture>BE</CountryDeparture></ShipFrom><CountryOperation>FR</CountryOperation><Installation>1</Installation><DateTransaction>2018-06-27</DateTransaction></Conditions><Mentioning Country="BE"><Number>3</Number><Text>Livraison de biens non soumise à la TVA belge. Art. 14, § 3 CTVA / Article 36 - Directive 2006/112</Text></Mentioning><Mentioning Country="FR"><Number>261</Number><Text>Autoliquidation   ||  Art. 283, 1, 2 et 2ter du C.G.I. / Autoliquidation   ||  Article 194 - Directive 2006/112</Text></Mentioning><AdditionalMentioning><Text>De goederen worden geïnstalleerd. / Les biens sont installés. / The goods are installed.</Text></AdditionalMentioning><AdditionalMentioning><Text>Ze vertrekken vanuit België en de installatie gebeurt in Frankrijk. / Les biens partent de Belgique et l&#180;installation a lieu en France. / The goods depart from Belgium and are installed in France.</Text></AdditionalMentioning></Item><AmountsSummary CurrencyNumber="1"><VATTotals VATRate="0"><AmountDisconto>0</AmountDisconto><AmountExclVAT>1000</AmountExclVAT><AmountVAT>0</AmountVAT></VATTotals><Totals><TotalAmountVAT>0</TotalAmountVAT><TotalAmountInclVAT>1000</TotalAmountInclVAT><TotalAmountDisconto>0</TotalAmountDisconto><TotalAmountInclVATCash>1000</TotalAmountInclVATCash><TotalAmountPackagingCosts>0</TotalAmountPackagingCosts></Totals></AmountsSummary><CheckValue>100</CheckValue></iVATEngineInput>
]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>